/*************************************************************************
	> File Name: 119.c
	> Author: zhanghongyan 
	> Mail: 
	> Created Time: 2019年11月04日 星期一 09时09分24秒
 ************************************************************************/

#include<stdio.h>
int main(){
    int y, y0, y1, m, m0, m1, d, d0, d1;
    scanf("%d %d %d", &y, &m, &d);
    y0 = y1 = y;
    m0 = m1 = m;
    int month[13] = {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}; 
    if(y % 4 == 0 && y % 100 != 0 || y % 400 == 0){
            month[2] = 29;
     }
    d0 = d - 1;
    d1 = d + 1;
    if(d0 < 1){
        m0--;
        if(m0 < 1){
            y0--;
            m0 = 12;
        }
        d0 = month[m0];
    }
    if(d1 > month[m]){
        m1++;
        d1 = 1;
        if(m1 > 12){
            y1++;
            m1 = 1;
        }
    }
    printf("%d %d %d\n", y0, m0, d0);
    printf("%d %d %d", y1, m1, d1);
    return 0;
}
