/*************************************************************************
	> File Name: 153_某天是星期几.c
	> Author: zhanghongyan 
	> Mail: 
	> Created Time: 2019年11月08日 星期五 16时00分50秒
 ************************************************************************/

#include<stdio.h>
int main(){
    int k, j, y, m, q, h;
    scanf("%d %d %d", &y, &m, &q);
    if(m == 1) {
        m = 13;
        y--;
    }
    if(m == 2) {
        m = 14;
        y--;
    }
    j = y / 100;
    k = y % 100;
    h = (q + (26 * (m + 1) / 10) + k + (k / 4) + (j / 4) + (5 * j)) % 7;
    h = h - 1;
    if(h == -1) h = 6;
    if(h == 0) h = 7;
    printf("%d\n", h);
    return 0;
}
